In [1]:
import urllib.request    # needed for download of the example database
import shutil            # needed for unzipping of the example database

import sqlalchemy as sa
import pandas as pd

In [2]:
shutil.unpack_archive("chinook.zip")

# Using SQLAlchemy engine object

In [3]:
# open the connection to the SQLite database
engine = sa.create_engine("sqlite:///chinook.db")

# get the resulting table provided as a list of tuples
sql = sa.text("SELECT * FROM albums LIMIT 5")
with engine.connect() as conn:
    arr = conn.execute(sql).fetchall()
arr

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

The following code may be used to convert the result to Panda's `DataFrame`:

In [4]:
sql = sa.text("SELECT * FROM albums LIMIT 5")
df = pd.read_sql(sql, con=engine)
df

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

## Using Python magic connect
When the Python script works with a single database only and extra Python langauge extensions are allowed the following notation might be used. The following code creates the database engine connector object in a hidden variable and allows for the magic `%sql` to be used in the code chunks

In [5]:
# !pip install jupysql

In [6]:
%load_ext sql
%sql sqlite:///chinook.db

Deploy Dash apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

Connecting to 'sqlite:///chinook.db'

Using the magic sql connector this is a short way to execute a directly typed single line SQL query and print the result

In [7]:
%sql SELECT * FROM albums LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+---------------------------------------+----------+
| AlbumId |                 Title                 | ArtistId |
+---------+---------------------------------------+----------+
|    1    | For Those About To Rock We Salute You |    1     |
|    2    |           Balls to the Wall           |    2     |
|    3    |           Restless and Wild           |    2     |
|    4    |           Let There Be Rock           |    1     |
|    5    |                Big Ones               |    3     |
+---------+---------------------------------------+----------+

To print results of longer SQL commands which co not fit in a single line use double-percent notation `%%sql` as below:

In [8]:
%%sql
SELECT trackid, composer, unitprice FROM tracks LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+------------------------------------------------------------------------+-----------+
| TrackId |                                Composer                                | UnitPrice |
+---------+------------------------------------------------------------------------+-----------+
|    1    |               Angus Young, Malcolm Young, Brian Johnson                |    0.99   |
|    2    |                                  None                                  |    0.99   |
|    3    |          F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman           |    0.99   |
|    4    | F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman |    0.99   |
|    5    |                       Deaffy & R.A. Smith-Diesel                       |    0.99   |
+---------+------------------------------------------------------------------------+-----------+

# SQL querying and slecting data

## `SELECT` - querying the database
Selecting some/all columns and their order

In [9]:
%%sql
SELECT FirstName, LastName
  FROM customers 
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+-----------+-------------+
| FirstName |   LastName  |
+-----------+-------------+
|    Luís   |  Gonçalves  |
|   Leonie  |    Köhler   |
|  François |   Tremblay  |
|   Bjørn   |    Hansen   |
| František | Wichterlová |
+-----------+-------------+

In [10]:
%%sql
SELECT * 
  FROM customers 
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+------------+-----------+-------------+--------------------------------------------------+---------------------------------+---------------------+-------+----------------+------------+--------------------+--------------------+--------------------------+--------------+
| CustomerId | FirstName |   LastName  |                     Company                      |             Address             |         City        | State |    Country     | PostalCode |       Phone        |        Fax         |          Email           | SupportRepId |
+------------+-----------+-------------+--------------------------------------------------+---------------------------------+---------------------+-------+----------------+------------+--------------------+--------------------+--------------------------+--------------+
|     1      |    Luís   |  Gonçalves  | Embraer - Empresa Brasileira de Aeronáutica S.A. | Av. Brigadeiro Faria Lima, 2170 | São José dos Campos |   SP  |     Brazil     | 12227-000  | +55 (12) 3923-5555 | +55 (12) 3923-5566 |   luisg@embraer.com.br   |      3       |
|     2      |   Leonie  |    Köhler   |                       None                       |     Theodor-Heuss-Straße 34     |      Stuttgart      |  None |    Germany     |   70174    |  +49 0711 2842222  |        None        |  leonekohler@surfeu.de   |      5       |
|     3      |  François |   Tremblay  |                       None                       |        1498 rue Bélanger        |       Montréal      |   QC  |     Canada     |  H2G 1A7   | +1 (514) 721-4711  |        None        |   ftremblay@gmail.com    |      3       |
|     4      |   Bjørn   |    Hansen   |                       None                       |         Ullevålsveien 14        |         Oslo        |  None |     Norway     |    0171    |  +47 22 44 22 22   |        None        |  bjorn.hansen@yahoo.no   |      4       |
|     5      | František | Wichterlová |                 JetBrains s.r.o.                 |          Klanova 9/506          |        Prague       |  None | Czech Republic |   14700    |  +420 2 4172 5555  |  +420 2 4172 5555  | frantisekw@jetbrains.com |      4       |
+------------+-----------+-------------+--------------------------------------------------+---------------------------------+---------------------+-------+----------------+------------+--------------------+--------------------+--------------------------+--------------+

In [11]:
%%sql
SELECT TrackId, Name, UnitPrice
  FROM tracks
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+-----------+
| TrackId |                   Name                  | UnitPrice |
+---------+-----------------------------------------+-----------+
|    1    | For Those About To Rock (We Salute You) |    0.99   |
|    2    |            Balls to the Wall            |    0.99   |
|    3    |             Fast As a Shark             |    0.99   |
|    4    |            Restless and Wild            |    0.99   |
|    5    |           Princess of the Dawn          |    0.99   |
+---------+-----------------------------------------+-----------+

In [12]:
%%sql
SELECT TrackId, Name, UnitPrice + 10
  FROM tracks
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+----------------+
| TrackId |                   Name                  | UnitPrice + 10 |
+---------+-----------------------------------------+----------------+
|    1    | For Those About To Rock (We Salute You) |     10.99      |
|    2    |            Balls to the Wall            |     10.99      |
|    3    |             Fast As a Shark             |     10.99      |
|    4    |            Restless and Wild            |     10.99      |
|    5    |           Princess of the Dawn          |     10.99      |
+---------+-----------------------------------------+----------------+

In [13]:
%%sql
SELECT TrackId, Name, UnitPrice + 10 AS NewPrice
  FROM tracks
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+----------+
| TrackId |                   Name                  | NewPrice |
+---------+-----------------------------------------+----------+
|    1    | For Those About To Rock (We Salute You) |  10.99   |
|    2    |            Balls to the Wall            |  10.99   |
|    3    |             Fast As a Shark             |  10.99   |
|    4    |            Restless and Wild            |  10.99   |
|    5    |           Princess of the Dawn          |  10.99   |
+---------+-----------------------------------------+----------+

In [14]:
%%sql
SELECT TrackId, Name, UnitPrice + 10
  FROM tracks

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+----------------+
| TrackId |                   Name                  | UnitPrice + 10 |
+---------+-----------------------------------------+----------------+
|    1    | For Those About To Rock (We Salute You) |     10.99      |
|    2    |            Balls to the Wall            |     10.99      |
|    3    |             Fast As a Shark             |     10.99      |
|    4    |            Restless and Wild            |     10.99      |
|    5    |           Princess of the Dawn          |     10.99      |
|    6    |          Put The Finger On You          |     10.99      |
|    7    |             Let's Get It Up             |     10.99      |
|    8    |             Inject The Venom            |     10.99      |
|    9    |                Snowballed               |     10.99      |
|    10   |                Evil Walks               |     10.99      |
+---------+-----------------------------------------+----------------+
Truncated to displaylimit of 10.

### `ORDER` - sorting rows

In [15]:
%%sql
SELECT Name, Milliseconds, AlbumId
  FROM tracks
  ORDER BY AlbumID DESC
  LIMIT 10

Running query in 'sqlite:///chinook.db'

+------------------------------------------------------------------------------------------+--------------+---------+
|                                           Name                                           | Milliseconds | AlbumId |
+------------------------------------------------------------------------------------------+--------------+---------+
|                                      Koyaanisqatsi                                       |    206005    |   347   |
| Quintet for Horn, Violin, 2 Violas, and Cello in E Flat Major, K. 407/386c: III. Allegro |    221331    |   346   |
|                           L'orfeo, Act 3, Sinfonia (Orchestra)                           |    66639     |   345   |
|   String Quartet No. 12 in C Minor, D. 703 "Quartettsatz": II. Andante - Allegro assai   |    139200    |   344   |
|                  Pini Di Roma (Pinien Von Rom) \ I Pini Della Via Appia                  |    286741    |   343   |
|      Concerto for Violin, Strings and Continuo in G Major, Op. 3, No. 9: I. Allegro      |    493573    |   342   |
|                                     Erlkonig, D.328                                      |    261849    |   341   |
|                     Étude 1, In C Major - Preludio (Presto) - Liszt                      |    51780     |   340   |
|                 24 Caprices, Op. 1, No. 24, for Solo Violin, in A Minor                  |    265541    |   339   |
|    Symphony No. 2, Op. 16 -  "The Four Temperaments": II. Allegro Comodo e Flemmatico    |    286998    |   338   |
+------------------------------------------------------------------------------------------+--------------+---------+
Truncated to displaylimit of 10.

In [16]:
%%sql 
SELECT City
  FROM customers
  LIMIT 10

Running query in 'sqlite:///chinook.db'

+---------------------+
|         City        |
+---------------------+
| São José dos Campos |
|      Stuttgart      |
|       Montréal      |
|         Oslo        |
|        Prague       |
|        Prague       |
|        Vienne       |
|       Brussels      |
|      Copenhagen     |
|      São Paulo      |
+---------------------+
Truncated to displaylimit of 10.

Use `DISTINCT` to select unique rows(remove duplicated rows)

In [17]:
%%sql 
SELECT DISTINCT City, FirstName
  FROM customers
  LIMIT 10

Running query in 'sqlite:///chinook.db'

+---------------------+-----------+
|         City        | FirstName |
+---------------------+-----------+
| São José dos Campos |    Luís   |
|      Stuttgart      |   Leonie  |
|       Montréal      |  François |
|         Oslo        |   Bjørn   |
|        Prague       | František |
|        Prague       |   Helena  |
|        Vienne       |   Astrid  |
|       Brussels      |    Daan   |
|      Copenhagen     |    Kara   |
|      São Paulo      |  Eduardo  |
+---------------------+-----------+
Truncated to displaylimit of 10.

### `WHERE` - selecting rows by a condition

In [18]:
%%sql
SELECT TrackId, Milliseconds
  FROM tracks
  WHERE Milliseconds > 300000
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+--------------+
| TrackId | Milliseconds |
+---------+--------------+
|    1    |    343719    |
|    2    |    342562    |
|    5    |    375418    |
|    15   |    331180    |
|    17   |    366654    |
+---------+--------------+

In [19]:
%%sql
SELECT FirstName, LastName, City
  FROM customers
  WHERE City = "Prague"

Running query in 'sqlite:///chinook.db'

+-----------+-------------+--------+
| FirstName |   LastName  |  City  |
+-----------+-------------+--------+
| František | Wichterlová | Prague |
|   Helena  |     Holý    | Prague |
+-----------+-------------+--------+

In [20]:
%%sql
SELECT FirstName, Country
  From customers
  WHERE Country = "Netherlands" OR Country = "Germany"
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+-----------+-------------+
| FirstName |   Country   |
+-----------+-------------+
|   Leonie  |   Germany   |
|   Hannah  |   Germany   |
|    Fynn   |   Germany   |
|   Niklas  |   Germany   |
|  Johannes | Netherlands |
+-----------+-------------+

In [21]:
%%sql
SELECT FirstName, Country
  From customers
  WHERE NOT (Country = "Netherlands" OR Country = "Germany")
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+-----------+----------------+
| FirstName |    Country     |
+-----------+----------------+
|    Luís   |     Brazil     |
|  François |     Canada     |
|   Bjørn   |     Norway     |
| František | Czech Republic |
|   Helena  | Czech Republic |
+-----------+----------------+

### `IS NULL` versu 'IS NOT NULL` missing value checking

In [22]:
%%sql
SELECT Name, Composer
  From tracks
  WHERE Composer IS NULL
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------------------------------------+----------+
|                  Name                 | Composer |
+---------------------------------------+----------+
|           Balls to the Wall           |   None   |
|               Desafinado              |   None   |
|           Garota De Ipanema           |   None   |
| Samba De Uma Nota Só (One Note Samba) |   None   |
|           Por Causa De Você           |   None   |
+---------------------------------------+----------+

### `IN` - Set membership (for categorical variables)

Compare the following two notations to test whether a value belongs to a set.

The `OR` notation works only with a fixed set of values and does not scale well.

In [23]:
%%sql
SELECT *
  FROM customers
  WHERE country IN ("Brazil", "Finland", "Poland", "Spain")

Running query in 'sqlite:///chinook.db'

+------------+-----------+------------+--------------------------------------------------+---------------------------------+---------------------+-------+---------+------------+--------------------+--------------------+-------------------------------+--------------+
| CustomerId | FirstName |  LastName  |                     Company                      |             Address             |         City        | State | Country | PostalCode |       Phone        |        Fax         |             Email             | SupportRepId |
+------------+-----------+------------+--------------------------------------------------+---------------------------------+---------------------+-------+---------+------------+--------------------+--------------------+-------------------------------+--------------+
|     1      |    Luís   | Gonçalves  | Embraer - Empresa Brasileira de Aeronáutica S.A. | Av. Brigadeiro Faria Lima, 2170 | São José dos Campos |   SP  |  Brazil | 12227-000  | +55 (12) 3923-5555 | +55 (12) 3923-5566 |      luisg@embraer.com.br     |      3       |
|     10     |  Eduardo  |  Martins   |                 Woodstock Discos                 |    Rua Dr. Falcão Filho, 155    |      São Paulo      |   SP  |  Brazil | 01007-010  | +55 (11) 3033-5446 | +55 (11) 3033-4564 |    eduardo@woodstock.com.br   |      4       |
|     11     | Alexandre |   Rocha    |               Banco do Brasil S.A.               |        Av. Paulista, 2022       |      São Paulo      |   SP  |  Brazil | 01310-200  | +55 (11) 3055-3278 | +55 (11) 3055-8131 |        alero@uol.com.br       |      5       |
|     12     |  Roberto  |  Almeida   |                      Riotur                      |         Praça Pio X, 119        |    Rio de Janeiro   |   RJ  |  Brazil | 20040-020  | +55 (21) 2271-7000 | +55 (21) 2271-7070 | roberto.almeida@riotur.gov.br |      3       |
|     13     |  Fernanda |   Ramos    |                       None                       |           Qe 7 Bloco G          |       Brasília      |   DF  |  Brazil | 71020-677  | +55 (61) 3363-5547 | +55 (61) 3363-7855 |    fernadaramos4@uol.com.br   |      4       |
|     44     |   Terhi   | Hämäläinen |                       None                       |         Porthaninkatu 9         |       Helsinki      |  None | Finland |   00530    |  +358 09 870 2000  |        None        |   terhi.hamalainen@apple.fi   |      3       |
|     49     | Stanisław |   Wójcik   |                       None                       |           Ordynacka 10          |        Warsaw       |  None |  Poland |   00-358   |  +48 22 828 37 39  |        None        |     stanisław.wójcik@wp.pl    |      4       |
|     50     |  Enrique  |   Muñoz    |                       None                       |        C/ San Bernardo 85       |        Madrid       |  None |  Spain  |   28015    |  +34 914 454 454   |        None        |     enrique_munoz@yahoo.es    |      5       |
+------------+-----------+------------+--------------------------------------------------+---------------------------------+---------------------+-------+---------+------------+--------------------+--------------------+-------------------------------+--------------+

### `BETWEEN` - Value in range (for numerical variables)
Use `BETWEEN` (and `NOT BETWEEN`) to find whetehr a vlaue is in (or out) a certain range

In [24]:
%%sql
SELECT InvoiceId, BillingAddress, InvoiceDate, Total
  FROM invoices
  WHERE InvoiceDate BETWEEN '2010-01-01' AND '2010-01-31'
  ORDER BY InvoiceDate

Running query in 'sqlite:///chinook.db'

+-----------+--------------------------------------+---------------------+-------+
| InvoiceId |            BillingAddress            |     InvoiceDate     | Total |
+-----------+--------------------------------------+---------------------+-------+
|     84    |           68, Rue Jouvence           | 2010-01-08 00:00:00 |  1.98 |
|     85    |          Erzsébet krt. 58.           | 2010-01-08 00:00:00 |  1.98 |
|     86    |        Via Degli Scipioni, 43        | 2010-01-09 00:00:00 |  3.96 |
|     87    |             Celsiusg. 9              | 2010-01-10 00:00:00 |  6.94 |
|     88    |           Calle Lira, 198            | 2010-01-13 00:00:00 | 17.91 |
|     89    | Rotenturmstraße 4, 1010 Innere Stadt | 2010-01-18 00:00:00 | 18.86 |
|     90    |           801 W 4th Street           | 2010-01-26 00:00:00 |  0.99 |
+-----------+--------------------------------------+---------------------+-------+

`LIKE` - Value matches a pattern (for text variables)

-1. To find the tracks whose names start with the `Wild` string, you use the percent sign `%` wildcard at the end of pattern.

-2. To find the tracks whose names end with `Wild` literal string, you use `%` wildcard at the begining and end of the pattern:

In [25]:
%%sql
SELECT TrackID, Name
  FROM tracks
  WHERE Name LIKE '%Wild%'

Running query in 'sqlite:///chinook.db'

+---------+---------------------------+
| TrackId |            Name           |
+---------+---------------------------+
|    4    |     Restless and Wild     |
|    32   |      Deuces Are Wild      |
|   775   |      Call Of The Wild     |
|   1245  |       Wildest Dreams      |
|   1869  | Where The Wild Things Are |
|   1973  |         Wild Side         |
|   2312  |      Near Wild Heaven     |
|   2627  |      Wild Hearted Son     |
|   2633  |        Wild Flower        |
|   2697  |         I Go Wild         |
+---------+---------------------------+
Truncated to displaylimit of 10.

Get track name by extract number of charcters and finish by `y`:

In [26]:
%%sql
SELECT Trackid, Name
  FROM tracks
  WHERE Name LIKE '___y'

Running query in 'sqlite:///chinook.db'

+---------+------+
| TrackId | Name |
+---------+------+
|   532   | Baby |
|   784   | Lazy |
|   843   | Otay |
|   948   | Easy |
+---------+------+

## Selecting exercise

## biggest tracks
Print(select) the top 10 biggest `tracks` according to size in `Bytes` columns

In [27]:
%%sql
SELECT *
  FROM tracks
  ORDER BY Bytes DESC
  LIMIT 10

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------+---------+-------------+---------+----------+--------------+------------+-----------+
| TrackId |             Name            | AlbumId | MediaTypeId | GenreId | Composer | Milliseconds |   Bytes    | UnitPrice |
+---------+-----------------------------+---------+-------------+---------+----------+--------------+------------+-----------+
|   3224  |   Through a Looking Glass   |   229   |      3      |    21   |   None   |   5088838    | 1059546140 |    1.99   |
|   2820  |    Occupation / Precipice   |   227   |      3      |    19   |   None   |   5286953    | 1054423946 |    1.99   |
|   3236  |       The Young Lords       |   253   |      3      |    20   |   None   |   2863571    | 587051735  |    1.99   |
|   3242  |   The Man With Nine Lives   |   253   |      3      |    20   |   None   |   2956998    | 577829804  |    1.99   |
|   2910  |             Dave            |   231   |      3      |    19   |   None   |   2825166    | 574325829  |    1.99   |
|   3235  |   The Magnificent Warriors  |   253   |      3      |    20   |   None   |   2924716    | 570152232  |    1.99   |
|   3231  |       The Lost Warrior      |   253   |      3      |    20   |   None   |   2920045    | 558872190  |    1.99   |
|   2902  |       Maternity Leave       |   231   |      3      |    21   |   None   |   2780416    | 555244214  |    1.99   |
|   3228  | Battlestar Galactica, Pt. 3 |   253   |      3      |    20   |   None   |   2927802    | 554509033  |    1.99   |
|   2832  |        The Woman King       |   227   |      3      |    18   |   None   |   2626376    | 552893447  |    1.99   |
+---------+-----------------------------+---------+-------------+---------+----------+--------------+------------+-----------+
Truncated to displaylimit of 10.

### Exercise: simple filtering
Write statements to get `tracks` with: the `AlbumId` equal to `1` and the `Bytes` length greater than 2e5msec

In [28]:
%%sql
SELECT *
  FROM tracks
  WHERE AlbumId = 1 AND Bytes > 200000

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+---------+-------------+---------+-------------------------------------------+--------------+----------+-----------+
| TrackId |                   Name                  | AlbumId | MediaTypeId | GenreId |                  Composer                 | Milliseconds |  Bytes   | UnitPrice |
+---------+-----------------------------------------+---------+-------------+---------+-------------------------------------------+--------------+----------+-----------+
|    1    | For Those About To Rock (We Salute You) |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    343719    | 11170334 |    0.99   |
|    6    |          Put The Finger On You          |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    205662    | 6713451  |    0.99   |
|    7    |             Let's Get It Up             |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    233926    | 7636561  |    0.99   |
|    8    |             Inject The Venom            |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    210834    | 6852860  |    0.99   |
|    9    |                Snowballed               |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    203102    | 6599424  |    0.99   |
|    10   |                Evil Walks               |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    263497    | 8611245  |    0.99   |
|    11   |                  C.O.D.                 |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    199836    | 6566314  |    0.99   |
|    12   |            Breaking The Rules           |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    263288    | 8596840  |    0.99   |
|    13   |         Night Of The Long Knives        |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    205688    | 6706347  |    0.99   |
|    14   |                Spellbound               |    1    |      1      |    1    | Angus Young, Malcolm Young, Brian Johnson |    270863    | 8817038  |    0.99   |
+---------+-----------------------------------------+---------+-------------+---------+-------------------------------------------+--------------+----------+-----------+
Truncated to displaylimit of 10.

### Exercise: filter with `IN`
Return `customers` from `State` of `FL`(Florida), `WA`(Washington), `CA`(California)

In [29]:
%%sql
SELECT *
  FROM customers
  WHERE State IN ("FL", "WA")

Running query in 'sqlite:///chinook.db'

+------------+-----------+----------+-----------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+-------------------------+--------------+
| CustomerId | FirstName | LastName |        Company        |     Address      |   City  | State | Country | PostalCode |       Phone       |        Fax        |          Email          | SupportRepId |
+------------+-----------+----------+-----------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+-------------------------+--------------+
|     17     |    Jack   |  Smith   | Microsoft Corporation | 1 Microsoft Way  | Redmond |   WA  |   USA   | 98052-8300 | +1 (425) 882-8080 | +1 (425) 882-8081 | jacksmith@microsoft.com |      5       |
|     22     |  Heather  | Leacock  |          None         | 120 S Orange Ave | Orlando |   FL  |   USA   |   32801    | +1 (407) 999-7788 |        None       |    hleacock@gmail.com   |      4       |
+------------+-----------+----------+-----------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+-------------------------+--------------+

### Exercise: fliter for numbers in range
Find `invoices` whose `Total` is between 14.96 and 18.86. Use `BETWEEN`.\

Sort the output with increasing `Total`. Show only these columns: `InvoiceId, BillingAddress`, 'Total`.

In [30]:
%%sql
SELECT *
  FROM invoices
  WHERE Total BETWEEN '14.96' AND '18.86'

Running query in 'sqlite:///chinook.db'

+-----------+------------+---------------------+--------------------------------------+-------------+--------------+----------------+-------------------+-------+
| InvoiceId | CustomerId |     InvoiceDate     |            BillingAddress            | BillingCity | BillingState | BillingCountry | BillingPostalCode | Total |
+-----------+------------+---------------------+--------------------------------------+-------------+--------------+----------------+-------------------+-------+
|     88    |     57     | 2010-01-13 00:00:00 |           Calle Lira, 198            |   Santiago  |     None     |     Chile      |        None       | 17.91 |
|     89    |     7      | 2010-01-18 00:00:00 | Rotenturmstraße 4, 1010 Innere Stadt |    Vienne   |     None     |    Austria     |        1010       | 18.86 |
|    103    |     24     | 2010-03-21 00:00:00 |        162 E Superior Street         |   Chicago   |      IL      |      USA       |       60611       | 15.86 |
|    201    |     25     | 2011-05-29 00:00:00 |        319 N. Frances Street         |   Madison   |      WI      |      USA       |       53703       | 18.86 |
|    208    |     4      | 2011-06-29 00:00:00 |           Ullevålsveien 14           |     Oslo    |     None     |     Norway     |        0171       | 15.86 |
|    306    |     5      | 2012-09-05 00:00:00 |            Klanova 9/506             |    Prague   |     None     | Czech Republic |       14700       | 16.86 |
|    313    |     43     | 2012-10-06 00:00:00 |           68, Rue Jouvence           |    Dijon    |     None     |     France     |       21000       | 16.86 |
+-----------+------------+---------------------+--------------------------------------+-------------+--------------+----------------+-------------------+-------+

In [31]:
%%sql
SELECT InVoiceId, BillingAddress, Total
  FROM invoices
  WHERE Total BETWEEN '14.96' AND '18.86'
  ORDER BY Total ASC

Running query in 'sqlite:///chinook.db'

+-----------+--------------------------------------+-------+
| InvoiceId |            BillingAddress            | Total |
+-----------+--------------------------------------+-------+
|    103    |        162 E Superior Street         | 15.86 |
|    208    |           Ullevålsveien 14           | 15.86 |
|    306    |            Klanova 9/506             | 16.86 |
|    313    |           68, Rue Jouvence           | 16.86 |
|     88    |           Calle Lira, 198            | 17.91 |
|     89    | Rotenturmstraße 4, 1010 Innere Stadt | 18.86 |
|    201    |        319 N. Frances Street         | 18.86 |
+-----------+--------------------------------------+-------+

### Exercise: filter partially matching words
Find the `tracks` whose `Names` contain a substring: `Br` (two letters), one letter, `wn` (two letters)

In [32]:
%%sql
SELECT *
  FROM tracks
  WHERE Name LIKE '%Br_wn%'

Running query in 'sqlite:///chinook.db'

+---------+----------------------+---------+-------------+---------+-----------+--------------+---------+-----------+
| TrackId |         Name         | AlbumId | MediaTypeId | GenreId |  Composer | Milliseconds |  Bytes  | UnitPrice |
+---------+----------------------+---------+-------------+---------+-----------+--------------+---------+-----------+
|   1053  | Bad, Bad Leroy Brown |    83   |      1      |    12   | jim croce |    169900    | 5548581 |    0.99   |
|   1150  |    Mr. Brownstone    |    90   |      2      |    1    |    None   |    228924    | 3816323 |    0.99   |
+---------+----------------------+---------+-------------+---------+-----------+--------------+---------+-----------+

### Exerise: filtering missing values

Find the `customers` who do not have phone numbers. In the result show only the name and the (missing) phone number.

In [33]:
%%sql
SELECT *
  FROM customers
  WHERE Phone IS NULL

Running query in 'sqlite:///chinook.db'

+------------+-----------+----------+---------+-------------------+----------+-------+---------+------------+-------+------+--------------------------+--------------+
| CustomerId | FirstName | LastName | Company |      Address      |   City   | State | Country | PostalCode | Phone | Fax  |          Email           | SupportRepId |
+------------+-----------+----------+---------+-------------------+----------+-------+---------+------------+-------+------+--------------------------+--------------+
|     45     |  Ladislav |  Kovács  |   None  | Erzsébet krt. 58. | Budapest |  None | Hungary |   H-1073   |  None | None | ladislav_kovacs@apple.hu |      3       |
+------------+-----------+----------+---------+-------------------+----------+-------+---------+------------+-------+------+--------------------------+--------------+

### Exercise: from the database to a Python list
Create a Python variable `bs` to be list containing all `tracks` sizes as provided in the `Bytes` column.\
Print the `type` of the `bs` variable. Print the first 10 elements of bs.

In [34]:
sql = sa.text("SELECT Bytes FROM tracks")
with engine.connect() as conn:
    bs = conn.execute(sql).fetchall()
bs
[b[0] for b in bs]

[11170334,
 5510424,
 3990994,
 4331779,
 6290521,
 6713451,
 7636561,
 6852860,
 6599424,
 8611245,
 6566314,
 8596840,
 6706347,
 8817038,
 10847611,
 7032162,
 12021261,
 8776140,
 10617116,
 12066294,
 8331286,
 10547154,
 9719579,
 10552051,
 8675345,
 10144730,
 8679940,
 10869391,
 10056995,
 11616195,
 7877453,
 7074167,
 7983270,
 10402398,
 8262039,
 9989331,
 12374569,
 9375567,
 8196916,
 6145404,
 7224246,
 5793082,
 9753256,
 7824837,
 8758008,
 9163588,
 7598866,
 7604601,
 9703359,
 16008629,
 4925362,
 9310272,
 11316328,
 7847716,
 7302550,
 12575396,
 8993793,
 9216057,
 6420530,
 11183647,
 8497788,
 7937731,
 5990473,
 9348428,
 4535401,
 5536496,
 8226934,
 4198774,
 8149148,
 4393377,
 7121735,
 5574957,
 6687994,
 4110053,
 12089673,
 8719426,
 7286305,
 14375310,
 12372536,
 10422447,
 9405526,
 10110980,
 12033110,
 11406431,
 5339931,
 6672176,
 6709793,
 5988186,
 7059624,
 6321091,
 8245793,
 8041411,
 4948095,
 4961887,
 7911634,
 7289084,
 7193162,
 7622615,
 8273592,
 9506571,
 9106160,
 8357387,
 7609178,
 9006158,
 7710800,
 7542942,
 8944205,
 9003592,
 9731988,
 10029406,
 2365897,
 1707084,
 1862126,
 2582553,
 2206986,
 2247846,
 2276788,
 2616981,
 2301989,
 2306019,
 1704918,
 1299960,
 8538199,
 15075616,
 8217867,
 9714812,
 19115680,
 10630578,
 8230661,
 9018565,
 10642901,
 8137421,
 9869647,
 7726948,
 10513905,
 9011701,
 9355309,
 8130090,
 8574746,
 9257358,
 11820932,
 18041629,
 11965109,
 6417460,
 13842549,
 9115657,
 9359475,
 8975814,
 12440200,
 8646737,
 7169049,
 12029390,
 6655170,
 21128525,
 6893363,
 16065830,
 6252071,
 9175517,
 3331776,
 9245971,
 10813386,
 7653880,
 5671374,
 4884969,
 11360486,
 1549074,
 6715413,
 161266,
 10489139,
 211997,
 7324125,
 387360,
 5709631,
 3067064,
 9875962,
 12843821,
 11443471,
 224313,
 7828873,
 5463690,
 12122946,
 9337917,
 9218499,
 8022764,
 9435693,
 8854240,
 16034404,
 8627004,
 13194463,
 11820908,
 11138147,
 16545657,
 7802095,
 4604995,
 5716994,
 14184984,
 7848282,
 7685363,
 6859518,
 4456321,
 5487056,
 6022698,
 4459946,
 19161377,
 5842196,
 3225364,
 4865597,
 15889054,
 7382703,
 2752161,
 4333651,
 5065932,
 4726981,
 5924159,
 6253200,
 7217126,
 9854062,
 10003747,
 4704104,
 8507446,
 10364247,
 9411272,
 14462072,
 6455134,
 10975007,
 5375395,
 5568574,
 12359161,
 5431854,
 9499590,
 6132843,
 5645703,
 5574848,
 6373932,
 7886937,
 4349539,
 6029673,
 5846442,
 7270749,
 8778172,
 10342226,
 5461468,
 4693941,
 5074189,
 12675305,
 1103013,
 6724966,
 5061413,
 5042447,
 8253934,
 7984291,
 7541688,
 9670057,
 3240816,
 7714954,
 7960868,
 6475159,
 4272821,
 5198539,
 4415557,
 2968650,
 2408550,
 6984813,
 5881293,
 8911641,
 9019677,
 6986421,
 7380787,
 10251097,
 8147224,
 9659152,
 7241817,
 6172781,
 9095410,
 8378065,
 2901397,
 7183969,
 8253618,
 3536938,
 6534200,
 13702771,
 8327676,
 7697230,
 8505985,
 6455080,
 7402658,
 10078050,
 7866924,
 7747747,
 8275673,
 6920424,
 7388466,
 8502588,
 5748424,
 8552474,
 6503533,
 7488852,
 7663348,
 10056970,
 6950332,
 9544383,
 9344477,
 8189093,
 7507866,
 6399761,
 8069934,
 5950952,
 9633659,
 8024386,
 8895073,
 9142937,
 7029400,
 10309980,
 8150846,
 8441034,
 8123466,
 8420093,
 8731945,
 7685326,
 9205941,
 8873358,
 7111596,
 6892516,
 6643207,
 6507950,
 6327391,
 7748006,
 7034985,
 6973625,
 6457752,
 7254147,
 7027525,
 6568081,
 6931328,
 6772813,
 5532564,
 10249958,
 8581414,
 6287257,
 13035765,
 5995686,
 8497116,
 5261022,
 10232581,
 12258175,
 4165650,
 6041133,
 12377615,
 20138673,
 23092953,
 7649679,
 11731061,
 5572993,
 6007019,
 8912465,
 4728586,
 22080051,
 2922044,
 10891682,
 9402241,
 9310370,
 9616640,
 9694508,
 9721084,
 9599937,
 9633755,
 9451845,
 9883335,
 9698729,
 8522591,
 9718778,
 9619196,
 10020122,
 8499591,
 8255254,
 7528825,
 8619173,
 9057557,
 4866476,
 9440676,
 6046678,
 8737489,
 6547648,
 6191752,
 5891697,
 7938246,
 8267067,
 5972430,
 4743149,
 7243166,
 9141343,
 7143328,
 10344491,
 5572240,
 5115428,
 8013065,
 9275929,
 12192989,
 8991141,
 5594341,
 9313740,
 7819755,
 9073350,
 7102545,
 5492069,
 6792493,
 13085596,
 5076048,
 6978601,
 12418147,
 11946327,
 4867667,
 15446975,
 21942829,
 13065612,
 9943129,
 17900787,
 9378873,
 8689618,
 7739042,
 11358573,
 7876564,
 8552861,
 12664591,
 8112242,
 8150479,
 9577577,
 8921404,
 9671923,
 8192339,
 7920353,
 7255404,
 8114582,
 8526760,
 7936928,
 7146372,
 10266007,
 7109267,
 7939886,
 6424915,
 6097210,
 7045314,
 7529336,
 6976194,
 8229734,
 9018078,
 7194424,
 8309077,
 7395034,
 5360574,
 6317021,
 5735902,
 8609783,
 6801116,
 10441590,
 9098263,
 10518284,
 9765802,
 8851060,
 9070880,
 9422926,
 9848545,
 10317185,
 10429398,
 9863942,
 9480777,
 9069394,
 5484747,
 5243078,
 7714939,
 7406008,
 5951736,
 5839426,
 4425128,
 5645755,
 4408983,
 6305550,
 2950224,
 4932366,
 4431357,
 5616891,
 5075241,
 6481753,
 5604618,
 5535061,
 7343176,
 6316430,
 7075573,
 2452653,
 14359478,
 8385478,
 11269612,
 11409720,
 9425200,
 9567075,
 12785876,
 9750990,
 11810238,
 9288007,
 7803074,
 6539422,
 7083012,
 6473395,
 8650647,
 5494406,
 8280636,
 8353191,
 5130056,
 7747108,
 7585112,
 6854219,
 5997444,
 5946265,
 6796523,
 7466288,
 8050268,
 6453213,
 8622495,
 13885612,
 12472890,
 4862277,
 6372433,
 6151831,
 9953962,
 6098150,
 11746781,
 13224055,
 5497025,
 7852328,
 9484504,
 4875374,
 5798202,
 16873005,
 4069688,
 9433620,
 6411149,
 6295223,
 5637959,
 6270503,
 7346254,
 7232123,
 12495906,
 14775708,
 9050022,
 11046952,
 7608759,
 24596235,
 20103125,
 26369966,
 8348257,
 11011286,
 21676727,
 7972503,
 11154468,
 16686580,
 11348710,
 10991159,
 11484362,
 8817757,
 11440689,
 10294741,
 9999506,
 11100945,
 10251428,
 10712216,
 11870956,
 9114880,
 11161196,
 8749492,
 11769507,
 11634337,
 9394769,
 9492487,
 9867455,
 11741062,
 8664601,
 10963305,
 9206802,
 9771348,
 9599353,
 12504234,
 24703884,
 8100449,
 7677671,
 9391004,
 6636465,
 8021589,
 7617432,
 6095524,
 7935898,
 6521676,
 9161539,
 9604273,
 10572752,
 7103608,
 7930264,
 6358868,
 6222536,
 11254474,
 7548434,
 26411634,
 11590284,
 15549224,
 9018024,
 5437017,
 6461370,
 18360449,
 7593713,
 17890773,
 29416781,
 11079866,
 15478450,
 16131272,
 27967919,
 6273225,
 10529483,
 7955114,
 7292197,
 12520126,
 39267613,
 29846063,
 27775442,
 24887209,
 5991903,
 11204006,
 6185636,
 6034685,
 5898810,
 5846041,
 6603153,
 6529487,
 6260820,
 5822645,
 6093124,
 6287531,
 5899898,
 5432236,
 9444385,
 9244238,
 7257663,
 9209827,
 6536918,
 6546063,
 6697510,
 6359750,
 13490008,
 13125975,
 5550356,
 5676090,
 6771624,
 7117769,
 4560873,
 7541177,
 7927967,
 5371483,
 6335548,
 5932799,
 6878359,
 6923473,
 5382354,
 7902328,
 5399626,
 9016916,
 5523628,
 8480140,
 8380320,
 7991295,
 6851151,
 7751360,
 8033885,
 3836641,
 4298006,
 5767474,
 4642359,
 9043825,
 8943000,
 6229590,
 4609835,
 6260214,
 5105874,
 5354252,
 5521804,
 4617559,
 4270414,
 4899579,
 5368701,
 6156567,
 5034670,
 6924024,
 21947845,
 5263675,
 5343807,
 5716603,
 7945235,
 9302129,
 7986637,
 10361866,
 5348175,
 7209080,
 9675875,
 6211173,
 5919224,
 5807474,
 4366455,
 8297482,
 6815126,
 4633440,
 12713813,
 7432978,
 7778319,
 5390811,
 11260814,
 6933135,
 4476563,
 7095702,
 7911683,
 8376000,
 7573301,
 6714582,
 6713066,
 6943576,
 8322240,
 9017535,
 6383472,
 6360785,
 7048676,
 5024963,
 9724145,
 9183808,
 8165048,
 8335629,
 10384506,
 7571834,
 7420347,
 5837495,
 6498661,
 6483952,
 9144031,
 6303205,
 8549393,
 8472964,
 7026317,
 8936345,
 6195854,
 7644604,
 5501379,
 7176909,
 7591066,
 8701064,
 8001505,
 6173806,
 11995679,
 10447868,
 8587578,
 8344405,
 20230089,
 15563967,
 6849310,
 8993056,
 13931179,
 6714807,
 13646606,
 8072036,
 9354480,
 10638390,
 16279366,
 12643813,
 13779332,
 10035180,
 19712753,
 7929493,
 12058906,
 10445353,
 9740361,
 9575295,
 6944928,
 15180849,
 11122183,
 12012452,
 9502646,
 9903835,
 7832790,
 11246496,
 14397671,
 8981030,
 8510755,
 11702232,
 9401383,
 14789410,
 9209693,
 10532053,
 10323804,
 10159566,
 9098561,
 11600029,
 8180421,
 9299131,
 10733847,
 11191650,
 9267550,
 10224612,
 10323804,
 7328516,
 11369671,
 8382800,
 12826582,
 8044864,
 8675026,
 8818093,
 10022428,
 6554330,
 6709579,
 8772471,
 7946614,
 6315321,
 11626228,
 7792604,
 12754921,
 8072171,
 11354742,
 10874679,
 8413103,
 9076997,
 9157021,
 9068960,
 9518842,
 8108507,
 11305791,
 9724150,
 8523388,
 7985133,
 6988128,
 8092463,
 8364633,
 7130830,
 8309725,
 10522352,
 10400020,
 8150318,
 11622738,
 8853324,
 10653494,
 14176083,
 10602166,
 12059507,
 12287103,
 9032315,
 21685807,
 11394473,
 11994859,
 8856165,
 8330047,
 10037362,
 11283582,
 7018586,
 8788760,
 6928434,
 9096726,
 9413777,
 10312775,
 9049542,
 9396942,
 10687311,
 10872787,
 11181446,
 7026441,
 8893682,
 9842240,
 7801108,
 7073899,
 8381029,
 9163253,
 11493463,
 8906539,
 9391439,
 10664698,
 7306143,
 6180414,
 5432518,
 8684639,
 5531841,
 7968525,
 8137254,
 6888030,
 5793959,
 9059416,
 8014346,
 5243721,
 7592504,
 9391041,
 14115792,
 5322942,
 5725684,
 8225889,
 8273540,
 5489787,
 9872606,
 9946681,
 7138399,
 8738973,
 6460941,
 6896288,
 7774207,
 8758819,
 7326923,
 9742568,
 6006154,
 8271980,
 6475042,
 7456807,
 6543487,
 9032835,
 10894406,
 7669922,
 9490542,
 12536275,
 7435192,
 7412975,
 6724021,
 7096781,
 15780747,
 8407355,
 6656596,
 8861119,
 8221247,
 4225077,
 10753135,
 7505887,
 7093746,
 6887544,
 4643227,
 8436300,
 3898976,
 7497361,
 7353567,
 8747367,
 8628841,
 7288162,
 10180103,
 9010917,
 7900683,
 8853647,
 7298027,
 9733572,
 9162435,
 12926140,
 8242626,
 6073008,
 4524972,
 8808812,
 9626136,
 6908609,
 6747658,
 7388369,
 8029054,
 6224997,
 6109259,
 9779971,
 13163733,
 5203430,
 8736776,
 11031254,
 5929427,
 6587802,
 9631296,
 10333123,
 4823036,
 11835367,
 16233080,
 7634387,
 7355898,
 11174250,
 15267802,
 8235607,
 1095012,
 7921313,
 8897778,
 7365321,
 7460829,
 5588756,
 4781949,
 11844320,
 3923789,
 7711669,
 7056323,
 9003882,
 6039502,
 5853561,
 7468463,
 6421400,
 8363467,
 8232342,
 3819255,
 6496742,
 9109340,
 9416186,
 7735473,
 11395296,
 10323157,
 9929799,
 ...]

# SQL grouping and summarizing

In [35]:
%%sql
SELECT *
  FROM tracks
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+---------+-------------+---------+------------------------------------------------------------------------+--------------+----------+-----------+
| TrackId |                   Name                  | AlbumId | MediaTypeId | GenreId |                                Composer                                | Milliseconds |  Bytes   | UnitPrice |
+---------+-----------------------------------------+---------+-------------+---------+------------------------------------------------------------------------+--------------+----------+-----------+
|    1    | For Those About To Rock (We Salute You) |    1    |      1      |    1    |               Angus Young, Malcolm Young, Brian Johnson                |    343719    | 11170334 |    0.99   |
|    2    |            Balls to the Wall            |    2    |      2      |    1    |                                  None                                  |    342562    | 5510424  |    0.99   |
|    3    |             Fast As a Shark             |    3    |      2      |    1    |          F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman           |    230619    | 3990994  |    0.99   |
|    4    |            Restless and Wild            |    3    |      2      |    1    | F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman |    252051    | 4331779  |    0.99   |
|    5    |           Princess of the Dawn          |    3    |      2      |    1    |                       Deaffy & R.A. Smith-Diesel                       |    375418    | 6290521  |    0.99   |
+---------+-----------------------------------------+---------+-------------+---------+------------------------------------------------------------------------+--------------+----------+-----------+

Using `GROUP BY` performed on the AlbumID prints one row for each value of `AlbumID`

In [36]:
%%sql
SELECT *
  FROM tracks
  GROUP BY AlbumID
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+---------+-------------+---------+-----------------------------------------------------+--------------+----------+-----------+
| TrackId |                   Name                  | AlbumId | MediaTypeId | GenreId |                       Composer                      | Milliseconds |  Bytes   | UnitPrice |
+---------+-----------------------------------------+---------+-------------+---------+-----------------------------------------------------+--------------+----------+-----------+
|    1    | For Those About To Rock (We Salute You) |    1    |      1      |    1    |      Angus Young, Malcolm Young, Brian Johnson      |    343719    | 11170334 |    0.99   |
|    2    |            Balls to the Wall            |    2    |      2      |    1    |                         None                        |    342562    | 5510424  |    0.99   |
|    3    |             Fast As a Shark             |    3    |      2      |    1    | F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman |    230619    | 3990994  |    0.99   |
|    15   |                 Go Down                 |    4    |      1      |    1    |                        AC/DC                        |    331180    | 10847611 |    0.99   |
|    23   |              Walk On Water              |    5    |      1      |    1    |   Steven Tyler, Joe Perry, Jack Blades, Tommy Shaw  |    295680    | 9719579  |    0.99   |
+---------+-----------------------------------------+---------+-------------+---------+-----------------------------------------------------+--------------+----------+-----------+

`COUNT` - counting rows for each `GROUP BY`

In [37]:
%%sql
SELECT COUNT(*)
  FROM tracks
  GROUP BY AlbumId

Running query in 'sqlite:///chinook.db'

+----------+
| COUNT(*) |
+----------+
|    10    |
|    1     |
|    3     |
|    8     |
|    15    |
|    13    |
|    12    |
|    14    |
|    8     |
|    14    |
+----------+
Truncated to displaylimit of 10.

In [38]:
%%sql
SELECT AlbumId, COUNT(*) As TracksNum
  FROM tracks
  GROUP BY AlbumId
  ORDER BY TracksNum ASC

Running query in 'sqlite:///chinook.db'

+---------+-----------+
| AlbumId | TracksNum |
+---------+-----------+
|    2    |     1     |
|   170   |     1     |
|   172   |     1     |
|   226   |     1     |
|   252   |     1     |
|   254   |     1     |
|   260   |     1     |
|   266   |     1     |
|   267   |     1     |
|   268   |     1     |
+---------+-----------+
Truncated to displaylimit of 10.

`HAVING`-filtering based on group aggregations results

In [39]:
%%sql
SELECT AlbumId, COUNT(*) AS TracksNum
  FROM tracks
  GROUP BY AlbumId
  HAVING TracksNum > 30
  ORDER BY TracksNum DESC
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------+
| AlbumId | TracksNum |
+---------+-----------+
|   141   |     57    |
|    23   |     34    |
+---------+-----------+

In [40]:
%%sql
SELECT AVG(Milliseconds) AS MeanMilliseconds
  FROM tracks

Running query in 'sqlite:///chinook.db'

+-------------------+
|  MeanMilliseconds |
+-------------------+
| 393599.2121039109 |
+-------------------+

In [41]:
%%sql
SELECT AlbumId, GROUP_CONCAT( Name, ";" ) AS TrackNames
  FROM tracks 
  GROUP BY AlbumId
  LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| AlbumId |                                                                                                TrackNames                                                                                               |
+---------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|    1    |            For Those About To Rock (We Salute You);Put The Finger On You;Let's Get It Up;Inject The Venom;Snowballed;Evil Walks;C.O.D.;Breaking The Rules;Night Of The Long Knives;Spellbound           |
|    2    |                                                                                            Balls to the Wall                                                                                            |
|    3    |                                                                          Fast As a Shark;Restless and Wild;Princess of the Dawn                                                                         |
|    4    |                                        Go Down;Dog Eat Dog;Let There Be Rock;Bad Boy Boogie;Problem Child;Overdose;Hell Ain't A Bad Place To Be;Whole Lotta Rosie                                       |
|    5    | Walk On Water;Love In An Elevator;Rag Doll;What It Takes;Dude (Looks Like A Lady);Janie's Got A Gun;Cryin';Amazing;Blind Man;Deuces Are Wild;The Other Side;Crazy;Eat The Rich;Angel;Livin' On The Edge |
+---------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

# Grouping and summarizing exercise

For this section you need `chinook.db` database file and working `%sql` magic.
If you don't have it, please go back to the previous section and follow the instructions.
The following code should not produce any errors:

## Exercise: summaries per group
Using SQL only create a table containing summary info of the `tracks` tables grouped by albums (so, by the `AlbumId` column). 

In the result table report columns:
- `AlbumId`
- `TracksNum`: the total count of tracks in the album
- `TotalPrice`: sum of all track `UnitPrice`s
- `MeanTrackSec`: based on `Milliseconds`, the average time duration of tracks expressed in seconds

Order the final table with decreasing `TotalPrice`. Show first 10 rows.
Additionally, you may `ROUND` the prices to two positions and times to full seconds.

In [49]:
%%sql
SELECT AlbumId, COUNT(*) AS TracksNum, SUM(UnitPrice) AS TotalPrice, AVG(Milliseconds) AS MeanTrackSex
   FROM tracks
   GROUP BY AlbumId
   LIMIT 10

Running query in 'sqlite:///chinook.db'

+---------+-----------+--------------------+--------------------+
| AlbumId | TracksNum |     TotalPrice     |    MeanTrackSex    |
+---------+-----------+--------------------+--------------------+
|    1    |     10    |        9.9         |      240041.5      |
|    2    |     1     |        0.99        |      342562.0      |
|    3    |     3     | 2.9699999999999998 | 286029.3333333333  |
|    4    |     8     | 7.920000000000001  |     306657.375     |
|    5    |     15    | 14.850000000000001 | 294113.93333333335 |
|    6    |     13    | 12.870000000000001 | 265455.76923076925 |
|    7    |     12    |       11.88        | 270780.4166666667  |
|    8    |     14    | 13.860000000000001 | 207637.57142857142 |
|    9    |     8     | 7.920000000000001  |     333925.875     |
|    10   |     14    | 13.860000000000001 | 280550.9285714286  |
+---------+-----------+--------------------+--------------------+
Truncated to displaylimit of 10.

# Exercise: summaries per group (with pandas)

Use another strategy to generate the table from the previous exercise.
Use SQL only to get the complete `tracks` tables into a Pandas `DataFrame`.
Then, perform the same calculations using Pandas `groupby` and `agg` commands.

Now, imagine that the database is very large and remote, located on multiple servers somewhere in the world:

- What data are transmitted over the database connection in both exercises?
- Where are the calculations performed in both exercises?
- Which approach would scale better?

In [54]:
sql = sa.text("SELECT * FROM tracks")
df = pd.read_sql(sql, con=engine)
df
df.groupby('AlbumId', as_index=False)

# Exercise: filtering based on summary result

Find `AlbumId`s that have the number of tracks between 18 and 20. Show 5 rows.

# Exercise: concatenating texts in a group
Based on `tracks` grouped by `AlbumId`, create a table with two columns:
- `AlbumId`
- `Tracks`: a semicolon-separated concatenated track names of the album.

Show some 5 rows

In [55]:
%%sql
SELECT AlbumId, COUNT(*) AS TracksNum, SUM(UnitPrice) AS TotalPrice, AVG(Milliseconds) AS MeanTrackSex
   FROM tracks
   GROUP BY AlbumId
   LIMIT 5

Running query in 'sqlite:///chinook.db'

+---------+-----------+--------------------+--------------------+
| AlbumId | TracksNum |     TotalPrice     |    MeanTrackSex    |
+---------+-----------+--------------------+--------------------+
|    1    |     10    |        9.9         |      240041.5      |
|    2    |     1     |        0.99        |      342562.0      |
|    3    |     3     | 2.9699999999999998 | 286029.3333333333  |
|    4    |     8     | 7.920000000000001  |     306657.375     |
|    5    |     15    | 14.850000000000001 | 294113.93333333335 |
+---------+-----------+--------------------+--------------------+